Autodesk.Revit.DB.RadialDimension.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,System.Boolean)
Creates a new instance of an Radial Dimension element within the project.
document:
The document where new Radial Dimension is created.
dbView:
The view in which the Radial Dimension will appear.
arcRef:
The reference which the Radial Dimension will witness.
isDiameter:
Set to true to create a Diameter dimension
Returns:
The newly created Radial Dimension instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Reference should be an Arc reference and the origin should lie within the Arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.RadialDimension
An object that represents an Radial Dimension within the Revit project.
Since:
2025